Documents/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов</name>
  <registerRecords>InformationRegister.абс_ЗначенияСвойствНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СвойствоПриИзменении(Элемент)
	
	Если Объект.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;
	
	УстановитьВидимостьКолонкиСвойство();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;

	УстановитьВидимостьКолонкиСвойство();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонкиСвойство()
	
	Если ЗначениеЗаполнено(Объект.Свойство) Тогда
		МассивСтрокКУдалению = Новый Массив;
		Для Каждого СтрокаТаб ИЗ Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТаб.Свойство) И СтрокаТаб.Свойство <> Объект.Свойство Тогда
				МассивСтрокКУдалению.Добавить(СтрокаТаб);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСтрокКУдалению.Количество() > 0 
			И Вопрос("В строках табличной части присутствуют строки со свойством, отличным от свойства, указанного в шапке. Удалить такие строки?",
			РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из МассивСтрокКУдалению Цикл
			Объект.Товары.Удалить(ЭлементМассива);
		КонецЦикла;
		
		Элементы.Товары.ПодчиненныеЭлементы.ТоварыСвойство.Видимость = Ложь;
		
	Иначе
		Элементы.Товары.ПодчиненныеЭлементы.ТоварыСвойство.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И ЗначениеЗаполнено(Объект.Свойство) Тогда
		Элементы.Товары.ТекущиеДанные.Свойство = Объект.Свойство;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора(ПутьКДанным)
	
	Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным);
	Связи = Новый Массив;
	Связи.Добавить(Связь);
	Элементы.ТоварыЗначениеСвойства.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСвойствоПриИзменении(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;

КонецПроцедуры
